app/controllers/docs_controller.rb

SELECT * FROM "docs" WHERE (title LIKE '%haml%' OR body LIKE '%haml%') ORDER BY updated_at DESC LIMIT 10 OFFSET 0
SELECT count(DISTINCT docs.id) AS count_docs_id FROM "docs" WHERE (title LIKE '%リアルアーケード%' OR body LIKE '%リアルアーケード%')
---
  def index
    logger.debug "view_paths: #{view_paths}"
    where = Where.new

    unless params[:q].blank?
      where.and('title LIKE ?', "%#{params[:q]}%").
            or('body LIKE ?', "%#{params[:q]}%")

      @head_title = "#{params[:q]} - #{@title}"
    end

    @page = params[:page] || 1
    @per_page = params[:per_page] || 10

    @docs = Doc.paginate(
      :page => @page,
      :per_page => @per_page,
      :select => 'd.*',
      :from => 'docs d',
      :order => 'updated_at DESC',
      :conditions => where)

SELECT * FROM "docs" WHERE ("docs"."id" = 4244) ORDER BY updated_at DESC
---
  def show
    @doc = Doc.find(params[:id])

SELECT * FROM "docs" WHERE ("docs"."id" = 4247) ORDER BY updated_at DESC
---
  def edit
    @doc = Doc.find(params[:id])

INSERT INTO "docs" ("created_at", "title", "body", "updated_at") VALUES('2009-09-20 04:11:52', 'hoge', '<p>asldfjasfd<br />
---
  def create
    @doc = Doc.new(params[:doc])

    respond_to do |format|
      if @doc.save

SELECT * FROM "docs" WHERE ("docs"."id" = 4250) ORDER BY updated_at DESC
UPDATE "docs" SET "updated_at" = '2009-09-20 11:35:47', "body" = '<blockquote><a href="http://anond.hatelabo.jp/20090917111551">詳細よりもまず大枠をつかみたい、という事をわかってくれない先輩</a>
---
  def update
    @doc = Doc.find(params[:id])

    respond_to do |format|
      if @doc.update_attributes(params[:doc])