app/controllers/settings_controller.rb

  def show
    @setting = Setting.first
---
SELECT * FROM "settings" LIMIT 1

  def edit
    @setting = Setting.first
---
SELECT * FROM "settings" LIMIT 1

  def update
    @setting = Setting.first
---
SELECT * FROM "settings" LIMIT 1