app/controllers/top_controller.rb

SELECT * FROM "docs" ORDER BY updated_at DESC
---
  def sitemap
    @docs = Doc.all