app/controllers/users_controller.rb

SELECT * FROM "users" LIMIT 1
---
  def edit
    @user = User.first